# Weeks 7 & 8 Milestone #4

- Joshua Burden
- Bellevue University
- DSC540 Data Preparation
- Cathrine Williams
- 07/31/2022

In [91]:
import requests
import os
import urllib.request
import urllib.parse
from urllib.error import HTTPError,URLError
from bs4 import BeautifulSoup
import json
import pandas as pd
from matplotlib import pyplot as plt

# First Transformation

In [92]:
# put data into dataframe
url = pd.read_html('https://en.wikipedia.org/wiki/Template:COVID-19_pandemic_data')
covid_df = url[0]

In [93]:
covid_df

,Unnamed: 0,Location,Cases,Deaths
0,NaN,World[a],576816688,6399498
1,NaN,European Union[b],159459428,1119284
2,NaN,United States,91309159,1029925
3,NaN,India,44019811,526357
4,NaN,France,33848327,152052
...,...,...,...,...
214,NaN,Marshall Islands,64,—
215,NaN,Vatican City,29,0
216,NaN,"Saint Helena, Ascension and Tristan da Cunha",4,—
217,NaN,North Korea,1,6
218,.mw-parser-output .reflist{font-size:90%;margi...,.mw-parser-output .reflist{font-size:90%;margi...,.mw-parser-output .reflist{font-size:90%;margi...,.mw-parser-output .reflist{font-size:90%;margi...

# Second Transfomation

In [94]:

# Replace headers

covid_df = covid_df.rename(columns={
        'Unnamed: 0':'Flags',
        'Location':'Region/Country',
        'Cases':'Reported Cases',
        'Deaths':'Reported Deaths'
})

In [95]:
covid_df

,Flags,Region/Country,Reported Cases,Reported Deaths
0,NaN,World[a],576816688,6399498
1,NaN,European Union[b],159459428,1119284
2,NaN,United States,91309159,1029925
3,NaN,India,44019811,526357
4,NaN,France,33848327,152052
...,...,...,...,...
214,NaN,Marshall Islands,64,—
215,NaN,Vatican City,29,0
216,NaN,"Saint Helena, Ascension and Tristan da Cunha",4,—
217,NaN,North Korea,1,6
218,.mw-parser-output .reflist{font-size:90%;margi...,.mw-parser-output .reflist{font-size:90%;margi...,.mw-parser-output .reflist{font-size:90%;margi...,.mw-parser-output .reflist{font-size:90%;margi...

# Third Transformation

In [96]:

#lots of NaN since the Flags are images I'm going to drop this column
covid_df.drop(labels=['Flags'],axis=1,inplace=True)

covid_df

,Region/Country,Reported Cases,Reported Deaths
0,World[a],576816688,6399498
1,European Union[b],159459428,1119284
2,United States,91309159,1029925
3,India,44019811,526357
4,France,33848327,152052
...,...,...,...
214,Marshall Islands,64,—
215,Vatican City,29,0
216,"Saint Helena, Ascension and Tristan da Cunha",4,—
217,North Korea,1,6
218,.mw-parser-output .reflist{font-size:90%;margi...,.mw-parser-output .reflist{font-size:90%;margi...,.mw-parser-output .reflist{font-size:90%;margi...

In [97]:
covid_df.head()

      Region/Country Reported Cases Reported Deaths
0           World[a]      576816688         6399498
1  European Union[b]      159459428         1119284
2      United States       91309159         1029925
3              India       44019811          526357
4             France       33848327          152052

# Fourth transformation

In [98]:
#check for Null values in dataframe
covid_df.isnull().sum()

Region/Country     0
Reported Cases     0
Reported Deaths    0
dtype: int64

# Fifth Transformation

In [99]:
#check for duplicate data

duplications = covid_df.duplicated().sum()

duplications

print(f"Found {duplications} in the dataset")

Found 0 in the dataset

In [100]:
covid_df.describe()

       Region/Country Reported Cases Reported Deaths
count             219            219             219
unique            219            219             209
top          World[a]      576816688               —
freq                1              1               3